{
  "modelTopology": {
    "class_name": "Model",
    "config": {
      "name": "model1",
      "layers": [
        {
          "name": "input1",
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              19,
              19,
              3
            ],
            "dtype": "float32",
            "sparse": false,
            "name": "input1"
          },
          "inbound_nodes": []
        },
        {
          "name": "conv2d_Conv2D1",
          "class_name": "Conv2D",
          "config": {
            "filters": 64,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_constraint": null,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "linear",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv2d_Conv2D1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "input1",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "batch_normalization_BatchNormalization1",
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "name": "batch_normalization_BatchNormalization1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_Conv2D1",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "re_lu_ReLU1",
          "class_name": "ReLU",
          "config": {
            "max_value": null,
            "name": "re_lu_ReLU1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_BatchNormalization1",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "conv2d_Conv2D2",
          "class_name": "Conv2D",
          "config": {
            "filters": 64,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_constraint": null,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "linear",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv2d_Conv2D2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "re_lu_ReLU1",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "batch_normalization_BatchNormalization2",
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "name": "batch_normalization_BatchNormalization2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_Conv2D2",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "re_lu_ReLU2",
          "class_name": "ReLU",
          "config": {
            "max_value": null,
            "name": "re_lu_ReLU2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_BatchNormalization2",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "conv2d_Conv2D3",
          "class_name": "Conv2D",
          "config": {
            "filters": 64,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_constraint": null,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "linear",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv2d_Conv2D3",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "re_lu_ReLU2",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "batch_normalization_BatchNormalization3",
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "name": "batch_normalization_BatchNormalization3",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_Conv2D3",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "add_Add1",
          "class_name": "Add",
          "config": {
            "name": "add_Add1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "re_lu_ReLU1",
                0,
                0,
                {}
              ],
              [
                "batch_normalization_BatchNormalization3",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "re_lu_ReLU3",
          "class_name": "ReLU",
          "config": {
            "max_value": null,
            "name": "re_lu_ReLU3",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_Add1",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "conv2d_Conv2D4",
          "class_name": "Conv2D",
          "config": {
            "filters": 64,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_constraint": null,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "linear",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv2d_Conv2D4",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "re_lu_ReLU3",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "batch_normalization_BatchNormalization4",
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "name": "batch_normalization_BatchNormalization4",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_Conv2D4",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "re_lu_ReLU4",
          "class_name": "ReLU",
          "config": {
            "max_value": null,
            "name": "re_lu_ReLU4",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_BatchNormalization4",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "conv2d_Conv2D5",
          "class_name": "Conv2D",
          "config": {
            "filters": 64,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_constraint": null,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "linear",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv2d_Conv2D5",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "re_lu_ReLU4",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "batch_normalization_BatchNormalization5",
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "name": "batch_normalization_BatchNormalization5",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_Conv2D5",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "add_Add2",
          "class_name": "Add",
          "config": {
            "name": "add_Add2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "re_lu_ReLU3",
                0,
                0,
                {}
              ],
              [
                "batch_normalization_BatchNormalization5",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "re_lu_ReLU5",
          "class_name": "ReLU",
          "config": {
            "max_value": null,
            "name": "re_lu_ReLU5",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_Add2",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "conv2d_Conv2D6",
          "class_name": "Conv2D",
          "config": {
            "filters": 64,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_constraint": null,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "linear",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv2d_Conv2D6",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "re_lu_ReLU5",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "batch_normalization_BatchNormalization6",
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "name": "batch_normalization_BatchNormalization6",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_Conv2D6",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "re_lu_ReLU6",
          "class_name": "ReLU",
          "config": {
            "max_value": null,
            "name": "re_lu_ReLU6",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_BatchNormalization6",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "conv2d_Conv2D7",
          "class_name": "Conv2D",
          "config": {
            "filters": 64,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_constraint": null,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "linear",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv2d_Conv2D7",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "re_lu_ReLU6",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "batch_normalization_BatchNormalization7",
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "name": "batch_normalization_BatchNormalization7",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_Conv2D7",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "add_Add3",
          "class_name": "Add",
          "config": {
            "name": "add_Add3",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "re_lu_ReLU5",
                0,
                0,
                {}
              ],
              [
                "batch_normalization_BatchNormalization7",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "re_lu_ReLU7",
          "class_name": "ReLU",
          "config": {
            "max_value": null,
            "name": "re_lu_ReLU7",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_Add3",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "conv2d_Conv2D8",
          "class_name": "Conv2D",
          "config": {
            "filters": 64,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_constraint": null,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "linear",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv2d_Conv2D8",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "re_lu_ReLU7",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "batch_normalization_BatchNormalization8",
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "name": "batch_normalization_BatchNormalization8",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_Conv2D8",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "re_lu_ReLU8",
          "class_name": "ReLU",
          "config": {
            "max_value": null,
            "name": "re_lu_ReLU8",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_BatchNormalization8",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "conv2d_Conv2D9",
          "class_name": "Conv2D",
          "config": {
            "filters": 64,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_constraint": null,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "linear",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv2d_Conv2D9",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "re_lu_ReLU8",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "batch_normalization_BatchNormalization9",
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "name": "batch_normalization_BatchNormalization9",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_Conv2D9",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "add_Add4",
          "class_name": "Add",
          "config": {
            "name": "add_Add4",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "re_lu_ReLU7",
                0,
                0,
                {}
              ],
              [
                "batch_normalization_BatchNormalization9",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "re_lu_ReLU9",
          "class_name": "ReLU",
          "config": {
            "max_value": null,
            "name": "re_lu_ReLU9",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_Add4",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "conv2d_Conv2D10",
          "class_name": "Conv2D",
          "config": {
            "filters": 64,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_constraint": null,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "linear",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv2d_Conv2D10",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "re_lu_ReLU9",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "batch_normalization_BatchNormalization10",
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "name": "batch_normalization_BatchNormalization10",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_Conv2D10",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "re_lu_ReLU10",
          "class_name": "ReLU",
          "config": {
            "max_value": null,
            "name": "re_lu_ReLU10",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_BatchNormalization10",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "conv2d_Conv2D11",
          "class_name": "Conv2D",
          "config": {
            "filters": 64,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_constraint": null,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "linear",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv2d_Conv2D11",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "re_lu_ReLU10",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "batch_normalization_BatchNormalization11",
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "name": "batch_normalization_BatchNormalization11",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_Conv2D11",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "add_Add5",
          "class_name": "Add",
          "config": {
            "name": "add_Add5",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "re_lu_ReLU9",
                0,
                0,
                {}
              ],
              [
                "batch_normalization_BatchNormalization11",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "re_lu_ReLU11",
          "class_name": "ReLU",
          "config": {
            "max_value": null,
            "name": "re_lu_ReLU11",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_Add5",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "conv2d_Conv2D13",
          "class_name": "Conv2D",
          "config": {
            "filters": 1,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_constraint": null,
            "kernel_size": [
              1,
              1
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "linear",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv2d_Conv2D13",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "re_lu_ReLU11",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "conv2d_Conv2D12",
          "class_name": "Conv2D",
          "config": {
            "filters": 2,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_constraint": null,
            "kernel_size": [
              1,
              1
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "linear",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv2d_Conv2D12",
            "trainable": true,
            "batch_input_shape": [
              null,
              19,
              19,
              64
            ],
            "dtype": "float32"
          },
          "inbound_nodes": [
            [
              [
                "re_lu_ReLU11",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "batch_normalization_BatchNormalization13",
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "name": "batch_normalization_BatchNormalization13",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_Conv2D13",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "batch_normalization_BatchNormalization12",
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "name": "batch_normalization_BatchNormalization12",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_Conv2D12",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "re_lu_ReLU13",
          "class_name": "ReLU",
          "config": {
            "max_value": null,
            "name": "re_lu_ReLU13",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_BatchNormalization13",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "re_lu_ReLU12",
          "class_name": "ReLU",
          "config": {
            "max_value": null,
            "name": "re_lu_ReLU12",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_BatchNormalization12",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "flatten_Flatten2",
          "class_name": "Flatten",
          "config": {
            "name": "flatten_Flatten2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "re_lu_ReLU13",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "flatten_Flatten1",
          "class_name": "Flatten",
          "config": {
            "name": "flatten_Flatten1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "re_lu_ReLU12",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "dense_Dense1",
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "flatten_Flatten2",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "policy",
          "class_name": "Dense",
          "config": {
            "units": 361,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "policy",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "flatten_Flatten1",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "value",
          "class_name": "Dense",
          "config": {
            "units": 1,
            "activation": "tanh",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "value",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "dense_Dense1",
                0,
                0,
                {}
              ]
            ]
          ]
        }
      ],
      "input_layers": [
        [
          "input1",
          0,
          0
        ]
      ],
      "output_layers": [
        [
          "policy",
          0,
          0
        ],
        [
          "value",
          0,
          0
        ]
      ]
    },
    "keras_version": "tfjs-layers 4.22.0",
    "backend": "tensor_flow.js"
  },
  "weightsManifest": [
    {
      "paths": [
        "./weights.bin"
      ],
      "weights": [
        {
          "name": "conv2d_Conv2D1/kernel",
          "shape": [
            3,
            3,
            3,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_Conv2D1/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization1/gamma",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization1/beta",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_Conv2D2/kernel",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_Conv2D2/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization2/gamma",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization2/beta",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_Conv2D3/kernel",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_Conv2D3/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization3/gamma",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization3/beta",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_Conv2D4/kernel",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_Conv2D4/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization4/gamma",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization4/beta",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_Conv2D5/kernel",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_Conv2D5/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization5/gamma",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization5/beta",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_Conv2D6/kernel",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32"
